<script setup lang="ts">

</script>

<template>
<div class="w-full">
  <div>تک نفره ی مدرن مبل تک نفره چوبی با جدید ترین طراحی و با استفاده از بهترین متریال مصرفی ارائه می شود. توجه توجه پارچه مبل بصورت ساده میباشد کلاف استفاده شده در ساخت این محصول تماما چوب مرغوب و مستحکم روس می باشد.در پایه های این محصول از چوب خودرنگروس استفاده شده که علاوه بر نمای چوبی زیبا دوام بالایی نیز دارد.اسفنج مصرفی در قسمت نشیمن محصول اسفنج 35 کیلویی ویژه که مرغوب ترین نوع اسفنج است استفاده شده</div>
  <div class="flex flex-col  lg:flex-row-reverse gap-5">
    <div>تک نفره ی مدرن مبل تک نفره چوبی با جدید ترین طراحی
      و با استفاده از بهترین متریال مصرفی ارائه می شود. توجه توجه پارچه مبل بصورت ساده میباشد کلاف استفاده شده در ساخت این محصول تماما چوب مرغوب و مستحکم روس می باشد.در پایه های این محصول از چوب خودرنگروس استفاده شده که علاوه بر نمای چوبی زیبا دوام بالایی نیز دارد.اسفنج مصرفی در قسمت نشیمن محصول اسفنج 35 کیلویی ویژه که مرغوب ترین نوع اسفنج است اس تک نفره ی مدرن مبل تک نفره چوبی با جدید ترین طراحی
      و با استفاده از بهترین متریال مصرفی ارائه می شود. توجه توجه پارچه مبل بصورت ساده میباشد کلاف استفاده شده در ساخت این محصول تماما چوب مرغوب و مستحکم روس می باشد.در پایه های این محصول از چوب خودرنگروس استفاده شده که علاوه بر نمای چوبی زیبا دوام بالایی نیز دارد.اسفنج مصرفی در قسمت نشیمن محصول اسفنج 35 کیلویی ویژه که مرغوب ترین نوع اسفنج است استفاده شده</div>
    <img src="/public/image/id/1.png" alt="">
  </div>
  <div>
    <strong> تک نفره ی مدرن مبل تک نفره چوبی با جدید ترین طراحی </strong>
    <p>تک نفره ی مدرن مبل تک نفره چوبی با جدید ترین طراحی و با استفاده از بهترین متریال مصرفی ارائه می شود. توجه توجه پارچه مبل بصورت ساده میباشد کلاف استفاده شده در ساخت این محصول تماما چوب مرغوب و مستحکم روس می باشد.در پایه های این محصول از چوب خودرنگروس استفاده شده که علاوه بر نمای چوبی زیبا دوام بالایی نیز دارد.</p>
  </div>
  <div><p>تک نفره ی مدرن مبل تک نفره چوبی با جدید ترین طراحی و با استفاده از بهترین متریال مصرفی ارائه می شود. توجه توجه پارچه مبل بصورت ساده میباشد کلاف استفاده شده در ساخت این محصول تماما چوب مرغوب و مستحکم روس می باشد.در پایه های این محصول از چوب خودرنگروس استفاده شده که علاوه بر نمای چوبی زیبا دوام بالایی نیز دارد.اسفنج مصرفی در قسمت نشیمن محصول اسفنج 35 کیلویی ویژه که مرغوب ترین نوع اسفنج است استفاده شده که نشیمنی راحت و با دوام را به ارمغان می اورد.پارچه ی انتخاب شده برای این محصول پارچه ی مرغوب بوده که در سبک مدرن کاربرد زیادی دارد </p></div>
  <div><p>تک نفره ی مدرن مبل تک نفره چوبی با جدید ترین طراحی و با استفاده از بهترین متریال مصرفی ارائه می شود. توجه توجه پارچه مبل بصورت ساده میباشد کلاف استفاده شده در ساخت این محصول تماما چوب مرغوب و مستحکم روس می باشد.در پایه های این محصول از چوب خودرنگروس استفاده شده که علاوه بر نمای چوبی زیبا دوام بالایی نیز دارد.اسفنج مصرفی در قسمت نشیمن محصول اسفنج 35 کیلویی ویژه که مرغوب ترین نوع اسفنج است استفاده شده که نشیمنی راحت و با دوام را به ارمغان می اورد.پارچه ی انتخاب شده برای این محصول پارچه ی مرغوب بوده که در سبک مدرن کاربرد زیادی دارد </p></div>
  <div><p>تک نفره ی مدرن مبل تک نفره چوبی با جدید ترین طراحی و با استفاده از بهترین متریال مصرفی ارائه می شود. توجه توجه پارچه مبل بصورت ساده میباشد کلاف استفاده شده در ساخت این محصول تماما چوب مرغوب و مستحکم روس می باشد.در پایه های این محصول از چوب خودرنگروس استفاده شده که علاوه بر نمای چوبی زیبا دوام بالایی نیز دارد.اسفنج مصرفی در قسمت نشیمن محصول اسفنج 35 کیلویی ویژه که مرغوب ترین نوع اسفنج است استفاده شده که نشیمنی راحت و با دوام را به ارمغان می اورد.پارچه ی انتخاب شده برای این محصول پارچه ی مرغوب بوده که در سبک مدرن کاربرد زیادی دارد </p></div>
</div>
</template>

<style scoped lang="scss">
  div{
    line-height: 37px;
    font-size: 16px;
    text-align: justify;
  }
</style>